app/controllers/recipes_controller.rb

SELECT * FROM "recipes" WHERE ("recipes"."id" = 1)
---
  def show
    @recipe = Recipe.find(params[:id])

INSERT INTO "recipes" ("created_at", "title", "method", "updated_at") VALUES('2011-12-15 16:06:05', 'Sausage and Beans', 'Grill the sausages
---
  def create
    @recipe = Recipe.create(params[:recipe])

SELECT * FROM "recipes" WHERE ("recipes"."id" = 1)
UPDATE "recipes" SET "updated_at" = '2011-12-15 14:32:17', "method" = 'Toast bread, Grill bacon, butter toast, add HP sauce and then cut in half.' WHERE "id" = 1
---
  def update
    @recipe = Recipe.find(params[:id])
    if @recipe.save

SELECT * FROM "recipes" WHERE ("recipes"."id" = 1)
DELETE FROM "recipes" WHERE "id" = 1
---
  def destroy
    @recipe = Recipe.find(params[:id])
    @recipe.destroy